#+TITLE: Tema 2: Fundamentos de C
#+DATE:
#+STARTUP: beamer
#+SETUPFILE: config.org
#+OPTIONS: H:3


*** Variables y uso de =printf=
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  float num1 = 102.305;
  // Usamos %f para numeros reales
  printf("Esto es un numero real %f\n", num1);
  // Indicamos numero de decimales explicitamente
  printf("escrito con dos decimales %.2f\n", 102.305);
  
  double num2 = 103.56e10; 
  printf("Esto es un numero real %f\n", num2);
  printf("... en notacion cientifica %e\n", num2);
  printf("... y de forma automatica %g\n", num2);

  return 0;
}
#+END_SRC

#+RESULTS:
| Esto | es      | un  | número | real      | 102.3 |
| ...  | escrito | con | dos    | decimales | 102.3 |
#+RESULTS:
| Esto | es | un       | número     | real         | 1035600000000.0 |
| ...  | en | notación | científica | 1.035600e+12 |                 |
| ...  | y  | de       | forma      | automática   |      1.0356e+12 |

*** Definición, asignación de caracteres y uso de =printf=
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  // Usamos char para asignar caracteres
  char letra = 'z';
  printf("La ultima letra es la %c\n", letra);
  printf("La primera letra es la %c\n", 'a');  
  
  // Y char con un numero?
  // Tabla ASCII
  char letra = 122;
  printf("La ultima letra es la %c\n", letra);
  
  return 0;
}
#+END_SRC

#+RESULTS:
| La | última | letra | del | alfabeto | es    | la |   z |
| Su | valor  | en    | la  | tabla    | ASCII | es | 122 |
| El | número | 122   | es  | la       | letra | z  |     |


*** =sizeof=

Proporciona el tamaño de su operando en bytes.

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int i1;
  float f1;
  double d1;
  char c1;

  printf("Un entero ocupa %d bytes\n", sizeof i1);
  printf("Un float ocupa %d bytes\n", sizeof f1);
  printf("Un double ocupa %d bytes\n", sizeof d1);
  printf("Un caracter ocupa %d bytes\n", sizeof c1);

  return 0;
}
#+END_SRC

#+RESULTS:
| Un | entero   | ocupa  |     4 | bytes |       |
| Un | real     | ocupa  |     4 | bytes |       |
| Un | real     | double | ocupa | 8     | bytes |
| Un | caracter | ocupa  |     1 | bytes |       |

*** Aritméticos con enteros
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  int x, y, sum;
  x = 10;
  y = 15;
  sum = x + y;

  printf("La suma de %i con %i es %i\n",
	 x, y, sum);
  return 0;
}
#+END_SRC

#+RESULTS:
: La suma de 10 con 15 es 25


*** Aritméticos con caracteres
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  char letra, Letra;
  letra = 'z';
  Letra = letra - 32;

  printf("La letra %c en mayúscula es %c\n",
	 letra, Letra);
  return 0;
}
#+END_SRC

#+RESULTS:
: La letra z en mayúscula es Z

*** Conversión implícita
- Asignaciones :: el valor de la derecha se convierte al tipo de la variable de la izquierda (posible aviso o error).
#+BEGIN_SRC C
#include <stdio.h>

int main() {
  float f1 = 3.7, f2;
  int i1 = 2, i2;
  // Real a entero: pierde decimales
  i2 = f1;
  printf("Un real %f convertido a entero %d\n", 
	 f1, i2);
  // Entero a real: no cambia valor
  f2 = i1;
  printf("Un entero %d convertido a real %f\n",
	 i1, f2);
  return 0;
}
#+END_SRC

#+RESULTS:
| Un | real   | 3.7 | convertido | a | entero |   3 |
| Un | entero |   2 | convertido | a | real   | 2.0 |



*** Conversión explícita
- Conversión explícita o forzada :: =(tipo) expresión=
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  float f1 = 3.7, f2;
  int i1 = 2, i2;

  f2 = (float) i1;
  printf("Un entero %d convertido a real %f\n",
	 i1, f2);

  i2 = (int) f1;
  printf("Un real %f convertido a entero %d\n",
	 f1, i2);
  return 0;
}
#+END_SRC

#+RESULTS:
| Un | entero |   2 | convertido | a | real   | 2.0 |
| Un | real   | 3.7 | convertido | a | entero |   3 |

*** Conversión en expresiones
- Expresiones :: los valores de los operandos se convierten al tipo del operando que tenga la precisión más alta.

#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  double f1 = 100;
  int i1 = 150, i2 = 100;
  printf("Un entero, %d, dividido por un real, %f,",
	 i1, f1);
  printf(" produce un real, %f\n",
	 i1 / f1);
  printf("Un entero, %d, por un entero, %d: %d\n",
	 i1, i2, i1 / i2);
  return 0;
}
#+END_SRC

#+RESULTS:
| Un entero | 150 | dividido por un real |  100.0 | produce un real | 1.5 |
| Un entero | 150 | por un entero        | 100: 1 |                 |     |



# Local Variables:
# ispell-local-dictionary: "spanish"
# End:

